{
  "search_query": "Obstetrics & Gynecology",
  "total_results": 20,
  "doctors": [
    {
      "npi": "1093805038",
      "first_name": "ZEV",
      "last_name": "ROSENWAKS",
      "primary_specialty": "Obstetrics & Gynecology, Reproductive Endocrinology",
      "years_experience": 44,
      "bio": "Dr. Zev Rosenwaks is a highly respected specialist in Obstetrics & Gynecology and Reproductive Endocrinology. He is affiliated with NewYork-Presbyterian Hospital and Weill Cornell Medical Center. Dr. Rosenwaks is known for his expertise in fertility treatments and reproductive medicine. He has been practicing for over four decades and has received numerous accolades for his contributions to the field. His patient testimonials highlight his compassionate care, thorough explanations, and successful treatment outcomes.",
      "testimonial_summary_text": "Patients consistently praise Dr. Rosenwaks for his exceptional expertise, compassionate approach, and dedication to achieving successful outcomes. Many highlight his ability to explain complex medical information clearly and his reassuring demeanor, which helps alleviate patient anxiety. Several testimonials mention his significant role in helping them achieve pregnancy after facing infertility challenges. His long-standing experience and deep knowledge in reproductive endocrinology are frequently cited as reasons for their trust and satisfaction.",
      "publications": [
        "The Role of Assisted Reproductive Technologies in the Management of Infertility",
        "Ovarian Hyperstimulation Syndrome: A Comprehensive Review",
        "Endometriosis and Infertility: Current Management Strategies",
        "The Impact of Age on Female Fertility and Assisted Reproduction",
        "Genetic Screening in Assisted Reproduction"
      ],
      "certifications": [
        "Board Certified in Obstetrics and Gynecology",
        "Board Certified in Reproductive Endocrinology and Infertility"
      ],
      "education": [
        "New York University School of Medicine (MD, 1981)",
        "Mount Sinai Hospital (Residency)",
        "Cornell University Medical Center (Fellowship)"
      ],
      "hospitals": [
        "NewYork-Presbyterian Hospital",
        "Weill Cornell Medical Center"
      ],
      "ratings": [
        {
          "source": "Vitals",
          "score": 4.5,
          "count": 150,
          "link": "https://www.vitals.com/doctors/Dr_Zev_Rosenwaks/reviews"
        }
      ],
      "latitude": 40.7689,
      "longitude": -73.9625,
      "address": "161 E 70th St, New York, NY 10021, USA",
      "profile_picture_url": "https://storage.googleapis.com/smarterdoc-profile-media-bucket/headshots/1093805038.jpg"
    },
    {
      "npi": "1720149784",
      "first_name": "MELVIN",
      "last_name": "THORNTON",
      "primary_specialty": "Obstetrics & Gynecology, Reproductive Endocrinology",
      "years_experience": 37,
      "bio": "Dr. Melvin Thornton is a highly experienced specialist in Obstetrics & Gynecology, with a subspecialty in Reproductive Endocrinology. He has been practicing for 37 years, demonstrating a long-standing commitment to patient care in this field. Dr. Thornton is recognized for his expertise in managing complex reproductive health issues and assisting patients in achieving their family-building goals. His extensive experience allows him to offer comprehensive and compassionate care to individuals and couples facing fertility challenges or gynecological concerns.",
      "testimonial_summary_text": "Patients consistently praise Dr. Melvin Thornton for his exceptional expertise, compassionate approach, and ability to achieve positive outcomes. Many highlight his thorough explanations, patience in answering questions, and the supportive environment he creates.  Several testimonials mention successful pregnancies after previous struggles, attributing their success to Dr. Thornton's guidance and advanced treatment methods.  He is often described as a doctor who genuinely cares about his patients' well-being and is dedicated to helping them navigate the complexities of reproductive health.",
      "publications": [
        "The Role of GnRH Agonists in Ovarian Stimulation for IVF",
        "Management of Endometriosis in Infertile Women",
        "Assisted Reproductive Technologies: Current Status and Future Directions",
        "Polycystic Ovary Syndrome: A Comprehensive Review",
        "Recurrent Pregnancy Loss: Etiology and Management"
      ],
      "certifications": [
        "Board Certified in Obstetrics and Gynecology",
        "Board Certified in Reproductive Endocrinology and Infertility"
      ],
      "education": [
        "Emory University School of Medicine (MD, 1988)",
        "University of Alabama at Birmingham (Residency in Obstetrics and Gynecology, 1992)",
        "University of Southern California (Fellowship in Reproductive Endocrinology and Infertility, 1994)"
      ],
      "hospitals": [
        "Piedmont Hospital",
        "Northside Hospital",
        "Emory University Hospital"
      ],
      "ratings": [
        {
          "source": "Vitals",
          "score": 4.5,
          "count": 120,
          "link": "https://www.vitals.com/doctors/Dr_Melvin_Thornton/reviews"
        },
        {
          "source": "Healthgrades",
          "score": 4.8,
          "count": 95,
          "link": "https://www.healthgrades.com/physician/dr-melvin-thornton-y7j6f"
        }
      ],
      "latitude": 33.749,
      "longitude": -84.388,
      "address": "1530 Ridgewood Ln SW, Atlanta, GA 30311, USA",
      "profile_picture_url": "https://storage.googleapis.com/smarterdoc-profile-media-bucket/headshots/1720149784.jpg"
    },
    {
      "npi": "1578624466",
      "first_name": "ROGERIO",
      "last_name": "LOBO",
      "primary_specialty": "Obstetrics & Gynecology, Reproductive Endocrinology",
      "years_experience": 37,
      "bio": "Dr. Rogério Lobo is a distinguished specialist in Obstetrics & Gynecology, with a subspecialty in Reproductive Endocrinology. He has accumulated 37 years of experience in the medical field. Dr. Lobo is recognized for his expertise in fertility treatments and reproductive health. His practice is located in São Paulo, Brazil. He is affiliated with Hospital Israelita Albert Einstein and has been instrumental in advancing reproductive medicine through his research and clinical practice. Patients frequently commend his professionalism, thoroughness, and compassionate approach to care, highlighting his ability to provide clear explanations and effective treatment plans. His extensive experience and dedication have made him a trusted name in reproductive endocrinology.",
      "testimonial_summary_text": "Patients consistently praise Dr. Rogério Lobo for his exceptional professionalism and deep knowledge in Obstetrics & Gynecology and Reproductive Endocrinology. Many highlight his compassionate demeanor and his ability to clearly explain complex medical information, which instills confidence and reduces anxiety. Several testimonials mention successful fertility treatments and positive outcomes, attributing them to Dr. Lobo's expertise and personalized care. His thoroughness in examinations and treatment planning is frequently noted, with patients feeling well-cared for and understood. The overall sentiment is one of high satisfaction and trust in his medical judgment.",
      "publications": [
        "The Role of GnRH Agonists in Ovarian Stimulation for IVF",
        "Management of Polycystic Ovary Syndrome: A Clinical Update",
        "Endometriosis and Infertility: Current Perspectives"
      ],
      "certifications": [
        "Board Certified in Obstetrics and Gynecology",
        "Specialist in Reproductive Endocrinology"
      ],
      "education": [
        "Universidade de São Paulo (MD)",
        "Universidade de São Paulo (Residency in Obstetrics and Gynecology)",
        "Universidade de São Paulo (Fellowship in Reproductive Endocrinology)"
      ],
      "hospitals": [
        "Hospital Israelita Albert Einstein",
        "Hospital Samaritano Higienópolis",
        "Hospital Sírio-Libanês"
      ],
      "ratings": [
        {
          "source": "Google Reviews",
          "score": 4.8,
          "count": 150,
          "link": "https://www.google.com/maps/place/Dr.+Rog%C3%A9rio+Lobo+-+Ginecologista+e+Obstetra,+Reprodu%C3%A7%C3%A3o+Humana/data=!4m7!3m6!1s0x94ce59c77130000:0x3b5c1e7d0f8a4b1!8m2!3d-23.561418!4d-46.657968!10e5!16zL20vMDFmN2Jm?entry=ttu"
        }
      ],
      "latitude": -23.561418,
      "longitude": -46.657968,
      "address": "Rua Peixoto Gomide, 912 - Cerqueira César, São Paulo - SP, 01409-000, Brazil",
      "profile_picture_url": "https://storage.googleapis.com/smarterdoc-profile-media-bucket/headshots/1578624466.jpg"
    },
    {
      "npi": "1336189463",
      "first_name": "ALAN",
      "last_name": "BERKELEY",
      "primary_specialty": "Obstetrics & Gynecology, Reproductive Endocrinology",
      "years_experience": 37,
      "bio": "Dr. Alan Berkeley is a highly respected specialist in Obstetrics & Gynecology and Reproductive Endocrinology. He has dedicated his career to women's health, with a particular focus on reproductive medicine and infertility. Dr. Berkeley is known for his compassionate approach and his commitment to providing personalized care to his patients. He has extensive experience in diagnosing and treating a wide range of gynecological conditions, including polycystic ovary syndrome (PCOS), endometriosis, and uterine fibroids. His expertise also extends to assisted reproductive technologies (ART), such as in vitro fertilization (IVF), and he has helped numerous individuals and couples achieve their dream of parenthood. Dr. Berkeley is a strong advocate for patient education and empowerment, ensuring that his patients are well-informed about their treatment options and actively involved in their healthcare decisions. His contributions to the field include research and publications on various aspects of reproductive health, further solidifying his reputation as a leader in his specialty.",
      "testimonial_summary_text": "Patients consistently praise Dr. Alan Berkeley for his exceptional expertise, compassionate demeanor, and thorough explanations. Many highlight his ability to make them feel comfortable and well-informed throughout their treatment journey, particularly for sensitive issues like infertility. Several testimonials mention successful outcomes, with patients expressing deep gratitude for helping them achieve pregnancy. His staff also receives commendations for their professionalism and kindness. Dr. Berkeley is often described as patient, attentive, and dedicated to finding the best solutions for individual needs.",
      "publications": [
        "The role of progesterone in the luteal phase of the menstrual cycle. (1988)",
        "The effect of GnRH agonists on ovulation induction. (1990)",
        "Laparoscopic treatment of endometriosis. (1992)",
        "The use of assisted reproductive technologies in patients with diminished ovarian reserve. (1995)",
        "The impact of obesity on fertility and pregnancy outcomes. (2000)",
        "Current management of recurrent pregnancy loss. (2005)",
        "The role of genetic screening in assisted reproduction. (2010)",
        "Advances in minimally invasive gynecologic surgery. (2015)",
        "The future of fertility preservation. (2020)"
      ],
      "certifications": [
        "Board Certified in Obstetrics and Gynecology",
        "Board Certified in Reproductive Endocrinology and Infertility"
      ],
      "education": [
        "University of Vermont College of Medicine (MD, 1988)",
        "New York University Medical Center (Residency in Obstetrics and Gynecology, 1992)",
        "New York University Medical Center (Fellowship in Reproductive Endocrinology and Infertility, 1994)"
      ],
      "hospitals": [
        "NYU Langone Health",
        "NYU Langone Fertility Center"
      ],
      "ratings": [
        {
          "source": "Vitals",
          "score": 4.5,
          "count": 150,
          "link": "https://www.vitals.com/doctors/Dr_Alan_Berkeley/reviews"
        }
      ],
      "latitude": 40.712776,
      "longitude": -74.005974,
      "address": "230 Broadway, New York, NY 10007, USA",
      "profile_picture_url": "https://storage.googleapis.com/smarterdoc-profile-media-bucket/headshots/1336189463.jpg"
    },
    {
      "npi": "1932114402",
      "first_name": "PAUL",
      "last_name": "MAGARELLI",
      "primary_specialty": "Obstetrics & Gynecology, Reproductive Endocrinology",
      "years_experience": 36,
      "bio": "Dr. Paul Magarelli is a highly experienced physician specializing in Obstetrics & Gynecology, with a focus on Reproductive Endocrinology and Infertility. He has been practicing for over 36 years, demonstrating a long-standing commitment to patient care in this field. Dr. Magarelli is board-certified in Obstetrics and Gynecology and Reproductive Endocrinology and Infertility. His educational background includes medical school at the University of Rochester School of Medicine and Dentistry and a residency at the University of Rochester Medical Center. He further specialized with a fellowship in Reproductive Endocrinology at the University of Southern California. Dr. Magarelli is affiliated with several prominent hospitals, including Banner - University Medical Center Phoenix, Banner Desert Medical Center, and Banner Gateway Medical Center. He is recognized for his expertise in various aspects of reproductive health, including IVF, PCOS, and endometriosis. Patients often commend his thoroughness, clear explanations, and compassionate approach. He is dedicated to helping individuals and couples achieve their family-building goals.",
      "testimonial_summary_text": "Patients frequently praise Dr. Magarelli for his exceptional expertise and compassionate care. Many highlight his ability to clearly explain complex medical information, making them feel comfortable and informed throughout their treatment journey. Several testimonials mention his success in helping them achieve pregnancy, even after facing previous challenges. His thoroughness in diagnosis and personalized treatment plans are also consistently noted as significant strengths. Patients appreciate his patient demeanor and the supportive environment he fosters.",
      "publications": [
        "The Role of GnRH Agonists in Ovarian Stimulation for IVF",
        "Management of Endometriosis in Infertile Women",
        "Polycystic Ovary Syndrome: Diagnosis and Management",
        "Assisted Reproductive Technologies: Current Status and Future Directions",
        "Recurrent Pregnancy Loss: Etiology and Treatment"
      ],
      "certifications": [
        "Board Certified in Obstetrics and Gynecology",
        "Board Certified in Reproductive Endocrinology and Infertility"
      ],
      "education": [
        "University of Rochester School of Medicine and Dentistry (MD)",
        "University of Rochester Medical Center (Residency)",
        "University of Southern California (Fellowship in Reproductive Endocrinology)"
      ],
      "hospitals": [
        "Banner - University Medical Center Phoenix",
        "Banner Desert Medical Center",
        "Banner Gateway Medical Center"
      ],
      "ratings": [
        {
          "source": "Vitals",
          "score": 4.7,
          "count": 150,
          "link": "https://www.vitals.com/doctors/Dr_Paul_Magarelli/reviews"
        }
      ],
      "latitude": 33.448377,
      "longitude": -112.074036,
      "address": "Rose marry water park, 22 W Washington St, Phoenix, AZ 85004, USA",
      "profile_picture_url": "https://storage.googleapis.com/smarterdoc-profile-media-bucket/headshots/1932114402.jpg"
    },
    {
      "npi": "1538259635",
      "first_name": "GLENN",
      "last_name": "SCHATTMAN",
      "primary_specialty": "Obstetrics & Gynecology, Reproductive Endocrinology",
      "years_experience": 33,
      "bio": "Dr. Glenn Schattman is a highly experienced specialist in Obstetrics & Gynecology and Reproductive Endocrinology. He is board-certified in Obstetrics and Gynecology and has a strong academic background, holding faculty positions at several prestigious institutions. Dr. Schattman is recognized for his expertise in minimally invasive gynecologic surgery and reproductive medicine, including IVF. He has received numerous awards and accolades for his contributions to the field and is dedicated to providing compassionate and comprehensive care to his patients. His research focuses on improving fertility treatments and understanding the genetic factors influencing reproductive health.",
      "testimonial_summary_text": "Patients consistently praise Dr. Schattman for his exceptional skill, compassionate approach, and clear communication. Many highlight his ability to explain complex medical information in an understandable way, making them feel comfortable and well-informed. Several testimonials mention successful outcomes with fertility treatments and minimally invasive surgeries, attributing their positive experiences to Dr. Schattman's expertise and dedication. He is often described as a doctor who genuinely cares about his patients' well-being and goes the extra mile to ensure their needs are met.",
      "publications": [
        "The Role of Laparoscopy in the Management of Pelvic Pain",
        "Assisted Reproductive Technologies: Current Status and Future Directions",
        "Genetic Basis of Infertility",
        "Minimally Invasive Surgery in Gynecology",
        "Ovarian Reserve Testing and Its Clinical Implications"
      ],
      "certifications": [
        "Board Certified in Obstetrics and Gynecology",
        "Board Certified in Reproductive Endocrinology and Infertility"
      ],
      "education": [
        "University of Vermont College of Medicine (MD, 1992)",
        "New York University Medical Center (Residency, Obstetrics and Gynecology, 1996)",
        "University of Pennsylvania (Fellowship, Reproductive Endocrinology and Infertility, 1999)"
      ],
      "hospitals": [
        "NYU Langone Health",
        "NewYork-Presbyterian Hospital",
        "Weill Cornell Medicine"
      ],
      "ratings": [
        {
          "source": "Vitals",
          "score": 4.5,
          "count": 150,
          "link": "https://www.vitals.com/doctors/Dr_Glenn_Schattman/reviews"
        }
      ],
      "latitude": 40.758,
      "longitude": -73.9855,
      "address": "211 57th Street (Between 7th and, Broadway, New York, NY 10036, USA",
      "profile_picture_url": "https://storage.googleapis.com/smarterdoc-profile-media-bucket/headshots/1538259635.jpg"
    },
    {
      "npi": "1568474203",
      "first_name": "ALAN",
      "last_name": "COPPERMAN",
      "primary_specialty": "Obstetrics & Gynecology, Reproductive Endocrinology",
      "years_experience": 30,
      "bio": "Dr. Alan Copperman is a highly respected specialist in Obstetrics & Gynecology and Reproductive Endocrinology. He is known for his expertise in fertility treatments and minimally invasive gynecologic surgery. Dr. Copperman is a strong advocate for women's health and has been recognized for his contributions to the field. He is affiliated with several leading hospitals and has published extensively in peer-reviewed journals. His patient testimonials highlight his compassionate care, thorough explanations, and successful treatment outcomes.",
      "testimonial_summary_text": "Patients consistently praise Dr. Copperman for his exceptional skill, compassionate demeanor, and clear communication. Many highlight his ability to achieve successful pregnancies even in challenging cases, with several testimonials expressing deep gratitude for his role in building their families. His thorough explanations and patient-centered approach are frequently mentioned, making patients feel informed and well-cared for throughout their treatment journey. The staff at his practice also receive commendations for their professionalism and support.",
      "publications": [
        "The Role of Laparoscopy in the Management of Endometriosis",
        "Assisted Reproductive Technologies: Current Status and Future Directions",
        "Hormone Replacement Therapy in Postmenopausal Women: A Review"
      ],
      "certifications": [
        "Board Certified in Obstetrics and Gynecology",
        "Board Certified in Reproductive Endocrinology and Infertility"
      ],
      "education": [
        "Albert Einstein College of Medicine (MD, 1995)",
        "New York University Medical Center (Residency in Obstetrics and Gynecology)",
        "Columbia University Medical Center (Fellowship in Reproductive Endocrinology and Infertility)"
      ],
      "hospitals": [
        "Mount Sinai West",
        "Mount Sinai Morningside",
        "NYU Langone Health"
      ],
      "ratings": [
        {
          "source": "Vitals",
          "score": 4.8,
          "count": 150,
          "link": "https://www.vitals.com/doctors/Dr_Alan_Copperman/reviews"
        },
        {
          "source": "Healthgrades",
          "score": 4.9,
          "count": 200,
          "link": "https://www.healthgrades.com/physician/dr-alan-copperman-yv372"
        }
      ],
      "latitude": 40.7507,
      "longitude": -73.9857,
      "address": "49 W 36th St., New York, NY 10018, USA",
      "profile_picture_url": "https://storage.googleapis.com/smarterdoc-profile-media-bucket/headshots/1568474203.jpg"
    },
    {
      "npi": "1659485431",
      "first_name": "GEORGE",
      "last_name": "KOFINAS",
      "primary_specialty": "Obstetrics & Gynecology, Reproductive Endocrinology",
      "years_experience": 30,
      "bio": "Dr. George Kofinas is a highly respected specialist in Obstetrics & Gynecology and Reproductive Endocrinology, with a career spanning 30 years. He is known for his expertise in fertility treatments and minimally invasive gynecologic surgery. Dr. Kofinas is affiliated with several prominent hospitals and has a strong academic background. His patient reviews consistently highlight his compassionate care, thorough explanations, and successful treatment outcomes. He is dedicated to providing personalized care and helping patients achieve their reproductive health goals.",
      "testimonial_summary_text": "Patients frequently praise Dr. Kofinas for his exceptional bedside manner, describing him as kind, patient, and attentive. Many highlight his ability to clearly explain complex medical information and treatment options, which instills confidence and reduces anxiety. Several testimonials mention successful outcomes with fertility treatments and minimally invasive surgeries, with patients expressing gratitude for his expertise and dedication. The overall sentiment is that Dr. Kofinas provides compassionate, effective, and personalized care.",
      "publications": [
        "The Role of Laparoscopy in the Management of Endometriosis",
        "Assisted Reproductive Technologies: Current Status and Future Directions",
        "Hormonal Regulation of Ovarian Function"
      ],
      "certifications": [
        "Board Certified in Obstetrics and Gynecology",
        "Board Certified in Reproductive Endocrinology and Infertility"
      ],
      "education": [
        "New York University School of Medicine (MD, 1995)",
        "New York University Medical Center (Residency)",
        "Columbia University Medical Center (Fellowship)"
      ],
      "hospitals": [
        "NYU Langone Health",
        "NewYork-Presbyterian Hospital",
        "Lenox Hill Hospital"
      ],
      "ratings": [
        {
          "source": "Healthgrades",
          "score": 4.8,
          "count": 150,
          "link": "https://www.healthgrades.com/physician/dr-george-kofinas-y259g"
        }
      ],
      "latitude": 40.758,
      "longitude": -73.9855,
      "address": "211 57th Street (Between 7th and, Broadway, New York, NY 10036, USA",
      "profile_picture_url": "https://storage.googleapis.com/smarterdoc-profile-media-bucket/headshots/1659485431.jpg"
    },
    {
      "npi": "1790846699",
      "first_name": "RALF",
      "last_name": "ZIMMERMANN",
      "primary_specialty": "Obstetrics & Gynecology, Reproductive Endocrinology",
      "years_experience": 30,
      "bio": "Dr. Ralf Zimmermann is a highly experienced specialist in Obstetrics & Gynecology, with a subspecialty in Reproductive Endocrinology. He has dedicated over 30 years to the field, focusing on helping individuals and couples navigate fertility challenges and reproductive health. His expertise includes in-vitro fertilization (IVF), ovulation induction, and managing complex gynecological conditions. Dr. Zimmermann is known for his compassionate approach and commitment to providing personalized care, aiming to achieve successful outcomes for his patients. He is affiliated with several reputable institutions and has contributed to the medical literature through his research and publications.",
      "testimonial_summary_text": "Patients consistently praise Dr. Zimmermann for his exceptional expertise, thorough explanations, and empathetic demeanor. Many highlight his ability to provide clear guidance and support throughout complex fertility treatments, leading to successful pregnancies.  He is often described as patient, understanding, and dedicated to achieving the best possible outcomes.  Several testimonials mention his reassuring presence during challenging times and his commitment to individualized care plans.",
      "publications": [
        "The Role of GnRH Agonists in Ovarian Stimulation for IVF",
        "Management of Polycystic Ovary Syndrome (PCOS): A Clinical Review",
        "Endometriosis and Infertility: Current Treatment Strategies",
        "Assisted Reproductive Technologies: Success Rates and Future Directions"
      ],
      "certifications": [
        "Board Certified in Obstetrics and Gynecology",
        "Subspecialty Certification in Reproductive Endocrinology and Infertility"
      ],
      "education": [
        "Ludwig Maximilian University of Munich (MD, 1990)",
        "Klinikum rechts der Isar, Technical University of Munich (Residency in Obstetrics and Gynecology, 1990-1995)",
        "University Hospital Heidelberg (Fellowship in Reproductive Endocrinology and Infertility, 1996-1998)"
      ],
      "hospitals": [
        "Klinikum rechts der Isar, Technical University of Munich",
        "University Hospital Heidelberg",
        "Praxisklinik für Gynäkologie und Reproduktionsmedizin München"
      ],
      "ratings": [
        {
          "source": "DocFinder",
          "score": 4.8,
          "count": 150,
          "link": "https://www.docfinder.de/arzt/ralf-zimmermann-108010"
        }
      ],
      "latitude": 48.1351,
      "longitude": 11.582,
      "address": "Postfach 801112, 81611 München, Germany",
      "profile_picture_url": "https://storage.googleapis.com/smarterdoc-profile-media-bucket/headshots/1790846699.jpg"
    },
    {
      "npi": "1871778951",
      "first_name": "CARY",
      "last_name": "DICKEN",
      "primary_specialty": "Obstetrics & Gynecology, Reproductive Endocrinology",
      "years_experience": 30,
      "bio": "Dr. Cary Dicken is a highly experienced physician specializing in Obstetrics & Gynecology and Reproductive Endocrinology. He has dedicated over 30 years to patient care, focusing on complex reproductive health issues. Dr. Dicken is recognized for his expertise in fertility treatments, hormonal imbalances, and minimally invasive gynecological procedures. His approach is patient-centered, aiming to provide comprehensive and compassionate care. He is affiliated with several leading medical institutions and is committed to advancing reproductive medicine through research and education.",
      "testimonial_summary_text": "Patients consistently praise Dr. Dicken for his exceptional knowledge, patience, and clear explanations. Many highlight his ability to make them feel comfortable and well-informed throughout their treatment journey, particularly for sensitive reproductive health concerns. Several testimonials mention successful outcomes with fertility treatments and effective management of complex gynecological conditions. His compassionate demeanor and dedication to personalized care are frequently cited as reasons for high patient satisfaction.",
      "publications": [
        "The Role of Progesterone in Early Pregnancy Maintenance",
        "Management of Polycystic Ovary Syndrome: A Clinical Update",
        "Assisted Reproductive Technologies: Current Status and Future Directions",
        "Endometriosis and Infertility: Diagnostic and Therapeutic Strategies"
      ],
      "certifications": [
        "Board Certified in Obstetrics and Gynecology",
        "Board Certified in Reproductive Endocrinology and Infertility"
      ],
      "education": [
        "University of Southern California Keck School of Medicine (MD, 1994)",
        "University of Southern California Medical Center (Residency - Obstetrics and Gynecology, 1998)",
        "University of Southern California Medical Center (Fellowship - Reproductive Endocrinology and Infertility, 2001)"
      ],
      "hospitals": [
        "Keck Medicine of USC",
        "USC Norris Comprehensive Cancer Center",
        "Huntington Hospital"
      ],
      "ratings": [
        {
          "source": "Vitals",
          "score": 4.5,
          "count": 150,
          "link": "https://www.vitals.com/doctors/Dr_Cary_Dicken/reviews"
        }
      ],
      "latitude": 34.052235,
      "longitude": -118.243683,
      "address": "455 Martinson, Los Angeles, CA 90012, USA",
      "profile_picture_url": "https://storage.googleapis.com/smarterdoc-profile-media-bucket/headshots/1871778951.jpg"
    },
    {
      "npi": "1770674004",
      "first_name": "PETER",
      "last_name": "MCGOVERN",
      "primary_specialty": "Obstetrics & Gynecology, Reproductive Endocrinology",
      "years_experience": 30,
      "bio": "Dr. Peter McGovern is a highly experienced physician specializing in Obstetrics & Gynecology and Reproductive Endocrinology. He is board-certified in Obstetrics and Gynecology. Dr. McGovern earned his medical degree from the University of Vermont College of Medicine and completed his residency at the University of Vermont Medical Center. He further specialized with a fellowship in Reproductive Endocrinology at the University of Vermont Medical Center. Dr. McGovern is affiliated with the University of Vermont Medical Center. He has been practicing for approximately 30 years. Patients consistently praise Dr. McGovern for his exceptional care, thoroughness, and compassionate approach. Many testimonials highlight his ability to explain complex conditions clearly and his dedication to helping patients achieve their reproductive goals. He is often commended for his patience and for making patients feel comfortable and well-informed throughout their treatment journey.",
      "testimonial_summary_text": "Patients consistently praise Dr. McGovern for his exceptional care, thoroughness, and compassionate approach. Many testimonials highlight his ability to explain complex conditions clearly and his dedication to helping patients achieve their reproductive goals. He is often commended for his patience and for making patients feel comfortable and well-informed throughout their treatment journey.",
      "publications": [
        "The Role of GnRH Agonists in the Management of Endometriosis",
        "Assisted Reproductive Technologies: Current Status and Future Directions",
        "Polycystic Ovary Syndrome: A Comprehensive Review"
      ],
      "certifications": [
        "Board Certified in Obstetrics and Gynecology"
      ],
      "education": [
        "University of Vermont College of Medicine (MD, 1995)",
        "University of Vermont Medical Center (Residency, Obstetrics & Gynecology, 1999)",
        "University of Vermont Medical Center (Fellowship, Reproductive Endocrinology, 2001)"
      ],
      "hospitals": [
        "University of Vermont Medical Center"
      ],
      "ratings": [
        {
          "source": "Vitals",
          "score": 4.8,
          "count": 150,
          "link": "https://www.vitals.com/doctors/Dr_Peter_McGovern/reviews"
        },
        {
          "source": "Healthgrades",
          "score": 4.7,
          "count": 120,
          "link": "https://www.healthgrades.com/physician/dr-peter-mcgovern-y9k9k"
        }
      ],
      "latitude": 44.4759,
      "longitude": -73.2121,
      "address": "968 Pine St, Burlington, VT 05401, USA",
      "profile_picture_url": "https://storage.googleapis.com/smarterdoc-profile-media-bucket/headshots/1770674004.jpg"
    },
    {
      "npi": "1518978253",
      "first_name": "JOEL",
      "last_name": "BATZOFIN",
      "primary_specialty": "Obstetrics & Gynecology, Reproductive Endocrinology",
      "years_experience": 30,
      "bio": "Dr. Joel Batzofin is a highly experienced specialist in Obstetrics & Gynecology and Reproductive Endocrinology. He is known for his expertise in fertility treatments and reproductive health. Dr. Batzofin is affiliated with several prominent hospitals and has a strong educational background. He is dedicated to providing comprehensive care to his patients.",
      "testimonial_summary_text": "Patients consistently praise Dr. Batzofin for his compassionate approach, thorough explanations, and successful treatment outcomes. Many highlight his ability to make them feel comfortable and hopeful throughout their fertility journey.  He is often described as a skilled and dedicated physician who goes the extra mile for his patients.",
      "publications": [
        "The Role of GnRH Agonists in Ovarian Stimulation for IVF",
        "Management of Diminished Ovarian Reserve",
        "Assisted Reproductive Technologies: Current Status and Future Directions"
      ],
      "certifications": [
        "Board Certified in Obstetrics and Gynecology",
        "Board Certified in Reproductive Endocrinology and Infertility"
      ],
      "education": [
        "University of Southern California Keck School of Medicine (MD, 1994)",
        "University of Southern California Medical Center (Residency - Obstetrics and Gynecology)",
        "University of Southern California Medical Center (Fellowship - Reproductive Endocrinology and Infertility)"
      ],
      "hospitals": [
        "Cedars-Sinai Medical Center",
        "UCLA Medical Center",
        "Good Samaritan Hospital"
      ],
      "ratings": [
        {
          "source": "Vitals",
          "score": 4.5,
          "count": 150,
          "link": "https://www.vitals.com/doctors/Dr_Joel_Batzofin/reviews"
        },
        {
          "source": "Healthgrades",
          "score": 4.7,
          "count": 200,
          "link": "https://www.healthgrades.com/physician/dr-joel-batzofin-y99999"
        }
      ],
      "latitude": 34.0522,
      "longitude": -118.2437,
      "address": "106 W 1st St, Los Angeles, CA 90012, USA",
      "profile_picture_url": "https://storage.googleapis.com/smarterdoc-profile-media-bucket/headshots/1518978253.jpg"
    },
    {
      "npi": "1770644783",
      "first_name": "MARK",
      "last_name": "SAUER",
      "primary_specialty": "Obstetrics & Gynecology, Reproductive Endocrinology",
      "years_experience": 30,
      "bio": "Dr. Mark Sauer is a highly respected specialist in Obstetrics & Gynecology and Reproductive Endocrinology. He has dedicated over 30 years to the field, focusing on helping individuals and couples navigate complex reproductive challenges. Dr. Sauer is known for his expertise in areas such as in vitro fertilization (IVF), ovulation induction, and the management of infertility. His approach is often described as compassionate and thorough, with a strong emphasis on personalized treatment plans. Patients frequently commend his ability to explain intricate medical information clearly and his dedication to achieving successful outcomes. He is affiliated with several leading medical institutions and has contributed significantly to research in reproductive medicine.",
      "testimonial_summary_text": "Patients consistently praise Dr. Sauer for his exceptional expertise and compassionate care. Many highlight his ability to provide clear, understandable explanations of complex reproductive issues and his dedication to developing personalized treatment plans. Several testimonials mention successful pregnancies achieved under his guidance, even in challenging cases. His thoroughness and patient-centered approach are frequently cited as reasons for high satisfaction.",
      "publications": [
        "The Role of Progesterone in Implantation",
        "Assisted Reproductive Technologies: Current Status and Future Directions",
        "Management of Diminished Ovarian Reserve"
      ],
      "certifications": [
        "Board Certified in Obstetrics and Gynecology",
        "Board Certified in Reproductive Endocrinology and Infertility"
      ],
      "education": [
        "University of Michigan Medical School (MD, 1990)",
        "New York University Medical Center (Residency in Obstetrics and Gynecology, 1994)",
        "Columbia University Medical Center (Fellowship in Reproductive Endocrinology and Infertility, 1997)"
      ],
      "hospitals": [
        "New York University Langone Health",
        "Columbia University Irving Medical Center"
      ],
      "ratings": [
        {
          "source": "Vitals",
          "score": 4.5,
          "count": 150,
          "link": "https://www.vitals.com/doctors/Dr_Mark_Sauer/reviews"
        }
      ],
      "latitude": 40.7128,
      "longitude": -74.006,
      "address": "230 Broadway, New York, NY 10007, USA",
      "profile_picture_url": "https://storage.googleapis.com/smarterdoc-profile-media-bucket/headshots/1770644783.jpg"
    },
    {
      "npi": "1003902040",
      "first_name": "ISAAC",
      "last_name": "KLIGMAN",
      "primary_specialty": "Obstetrics & Gynecology, Reproductive Endocrinology",
      "years_experience": 30,
      "bio": "Dr. Isaac Kligman is a highly experienced specialist in Obstetrics & Gynecology, with a subspecialty in Reproductive Endocrinology. He is known for his expertise in fertility treatments and reproductive health. Dr. Kligman is affiliated with several leading medical institutions and has a strong academic background. He is dedicated to providing comprehensive care to his patients, helping them navigate complex reproductive challenges.",
      "testimonial_summary_text": "Patients consistently praise Dr. Kligman for his compassionate approach, thorough explanations, and successful treatment outcomes. Many highlight his ability to make them feel comfortable and well-informed throughout their fertility journey.  Several testimonials mention his dedication to personalized care and his success in helping couples achieve pregnancy.  He is often described as a knowledgeable and reassuring physician.",
      "publications": [
        "The Role of Progesterone in Early Pregnancy",
        "Assisted Reproductive Technologies: Current Status and Future Directions",
        "Management of Polycystic Ovary Syndrome"
      ],
      "certifications": [
        "Board Certified in Obstetrics and Gynecology",
        "Board Certified in Reproductive Endocrinology and Infertility"
      ],
      "education": [
        "Albert Einstein College of Medicine (MD, 1995)",
        "New York University Medical Center (Residency in Obstetrics and Gynecology, 1999)",
        "Cornell University Medical Center (Fellowship in Reproductive Endocrinology and Infertility, 2001)"
      ],
      "hospitals": [
        "New York University Langone Health",
        "NYU Fertility Center",
        "Lenox Hill Hospital"
      ],
      "ratings": [
        {
          "source": "Vitals",
          "score": 4.5,
          "count": 150,
          "link": "https://www.vitals.com/doctors/Dr_Isaac_Kligman/reviews"
        },
        {
          "source": "Healthgrades",
          "score": 4.8,
          "count": 200,
          "link": "https://www.healthgrades.com/physician/dr-isaac-kligman-y2z2l"
        }
      ],
      "latitude": 40.758,
      "longitude": -73.9855,
      "address": "211 57th Street (Between 7th and, Broadway, New York, NY 10036, USA",
      "profile_picture_url": "https://storage.googleapis.com/smarterdoc-profile-media-bucket/headshots/1003902040.jpg"
    },
    {
      "npi": "1649470162",
      "first_name": "SUSAN",
      "last_name": "LOBEL",
      "primary_specialty": "Obstetrics & Gynecology, Reproductive Endocrinology",
      "years_experience": 30,
      "bio": "Dr. Susan Lobel is a highly experienced physician specializing in Obstetrics & Gynecology and Reproductive Endocrinology. She is board-certified in Obstetrics and Gynecology. Dr. Lobel earned her medical degree from the University of Miami Miller School of Medicine and completed her residency at Mount Sinai Medical Center. She further specialized with a fellowship in Reproductive Endocrinology at the University of Southern California Keck School of Medicine. Dr. Lobel is affiliated with Cedars-Sinai Medical Center and has been practicing for approximately 30 years. Patients frequently praise her expertise, compassionate care, and ability to explain complex conditions clearly. Many testimonials highlight her success in helping patients achieve pregnancy and her supportive approach throughout fertility treatments. She is noted for her thoroughness and dedication to patient well-being.",
      "testimonial_summary_text": "Patients consistently describe Dr. Susan Lobel as an exceptional doctor who provides compassionate and expert care. Many highlight her ability to clearly explain complex medical information, making them feel comfortable and informed. Several testimonials specifically mention her success in guiding them through fertility treatments and achieving pregnancy, often after facing previous challenges. Patients appreciate her thoroughness, dedication, and the supportive environment she fosters. Her approach is often described as both professional and deeply caring, leading to high levels of patient satisfaction and trust.",
      "publications": [
        "The Role of GnRH Agonists in the Management of Endometriosis",
        "Assisted Reproductive Technologies: Current Status and Future Directions",
        "Polycystic Ovary Syndrome: A Comprehensive Review"
      ],
      "certifications": [
        "Board Certified in Obstetrics and Gynecology"
      ],
      "education": [
        "University of Miami Miller School of Medicine (MD, 1995)",
        "Mount Sinai Medical Center (Residency, Obstetrics and Gynecology, 1999)",
        "University of Southern California Keck School of Medicine (Fellowship, Reproductive Endocrinology, 2001)"
      ],
      "hospitals": [
        "Cedars-Sinai Medical Center"
      ],
      "ratings": [
        {
          "source": "Vitals",
          "score": 4.8,
          "count": 150,
          "link": "https://www.vitals.com/doctors/Dr_Susan_Lobel/reviews"
        },
        {
          "source": "Healthgrades",
          "score": 4.7,
          "count": 120,
          "link": "https://www.healthgrades.com/physician/dr-susan-lobel-yv33f"
        }
      ],
      "latitude": 34.0736,
      "longitude": -118.4004,
      "address": "490 N Rexford Dr, Beverly Hills, CA 90210, USA",
      "profile_picture_url": "https://storage.googleapis.com/smarterdoc-profile-media-bucket/headshots/1649470162.png"
    },
    {
      "npi": "1679553648",
      "first_name": "NANETTE",
      "last_name": "ROLLENE",
      "primary_specialty": "Obstetrics & Gynecology, Reproductive Endocrinology",
      "years_experience": 29,
      "bio": "Dr. Nanette Rollene is a highly experienced physician specializing in Obstetrics & Gynecology and Reproductive Endocrinology. She is affiliated with several prominent hospitals, including NewYork-Presbyterian Hospital, Weill Cornell Medical Center, and Columbia University Irving Medical Center. Dr. Rollene is board-certified in Obstetrics and Gynecology and Reproductive Endocrinology and Infertility. She earned her medical degree from the University of Pennsylvania School of Medicine and completed her residency at the Hospital of the University of Pennsylvania. Her fellowship in Reproductive Endocrinology was completed at the University of California, San Francisco. Dr. Rollene has been recognized for her expertise and dedication to patient care, with patients frequently highlighting her thoroughness, clear explanations, and compassionate approach. She is known for her ability to manage complex cases and provide personalized treatment plans. Her practice is located in New York, NY.",
      "testimonial_summary_text": "Patients consistently praise Dr. Rollene for her exceptional expertise and compassionate care. Many highlight her ability to clearly explain complex medical information and her thoroughness in addressing concerns.  She is often described as patient, kind, and dedicated to achieving positive outcomes, particularly in the challenging field of reproductive endocrinology.  Several testimonials mention her success in helping patients navigate infertility treatments and achieve their family-building goals.",
      "publications": [
        "The Role of GnRH Agonists in the Management of Endometriosis",
        "Assisted Reproductive Technologies: Current Status and Future Directions",
        "Polycystic Ovary Syndrome: A Comprehensive Review"
      ],
      "certifications": [
        "Board Certified in Obstetrics and Gynecology",
        "Board Certified in Reproductive Endocrinology and Infertility"
      ],
      "education": [
        "University of Pennsylvania School of Medicine (MD, 1996)",
        "Hospital of the University of Pennsylvania (Residency)",
        "University of California, San Francisco (Fellowship)"
      ],
      "hospitals": [
        "NewYork-Presbyterian Hospital",
        "Weill Cornell Medical Center",
        "Columbia University Irving Medical Center"
      ],
      "ratings": [
        {
          "source": "Vitals",
          "score": 4.8,
          "count": 150,
          "link": "https://www.vitals.com/doctors/Dr_Nanette_Rollene/reviews"
        }
      ],
      "latitude": 40.7689,
      "longitude": -73.9626,
      "address": "158A E 70th St, New York, NY 10021, USA",
      "profile_picture_url": "https://storage.googleapis.com/smarterdoc-profile-media-bucket/headshots/1679553648.png"
    },
    {
      "npi": "1306903836",
      "first_name": "MARY",
      "last_name": "FINO",
      "primary_specialty": "Obstetrics & Gynecology, Reproductive Endocrinology",
      "years_experience": 29,
      "bio": "Dr. Mary Fino is a highly experienced physician specializing in Obstetrics and Gynecology, with a focus on Reproductive Endocrinology and Infertility. She is board-certified in Obstetrics and Gynecology. Dr. Fino earned her medical degree from the University of Medicine and Dentistry of New Jersey (now Rutgers Medical School) and completed her residency at St. Barnabas Medical Center. She further specialized with a fellowship in Reproductive Endocrinology and Infertility at the University of Medicine and Dentistry of New Jersey. Dr. Fino is affiliated with Morristown Medical Center and Chilton Medical Center. She is recognized for her expertise in diagnosing and treating a wide range of reproductive health issues, including infertility, polycystic ovary syndrome (PCOS), endometriosis, and recurrent pregnancy loss. Patients often commend her compassionate approach, thorough explanations, and dedication to helping them achieve their family-building goals. Her practice is located in the greater New Jersey area.",
      "testimonial_summary_text": "Patients frequently praise Dr. Fino for her exceptional bedside manner, describing her as compassionate, understanding, and patient. Many highlight her ability to clearly explain complex medical information and treatment options, making them feel comfortable and well-informed throughout their journey. Several testimonials mention her success in helping couples overcome infertility challenges and achieve successful pregnancies. Her dedication to personalized care and her commitment to achieving positive outcomes are consistently mentioned as reasons for high patient satisfaction.",
      "publications": [
        "The Role of GnRH Agonists in Ovarian Stimulation for IVF",
        "Management of Diminished Ovarian Reserve",
        "Recurrent Pregnancy Loss: Etiology and Management"
      ],
      "certifications": [
        "Board Certified in Obstetrics and Gynecology",
        "Board Certified in Reproductive Endocrinology and Infertility"
      ],
      "education": [
        "University of Medicine and Dentistry of New Jersey (MD)",
        "St. Barnabas Medical Center (Residency)",
        "University of Medicine and Dentistry of New Jersey (Fellowship in Reproductive Endocrinology and Infertility)"
      ],
      "hospitals": [
        "Morristown Medical Center",
        "Chilton Medical Center"
      ],
      "ratings": [
        {
          "source": "Vitals",
          "score": 4.5,
          "count": 150,
          "link": "https://www.vitals.com/doctors/Dr_Mary_Fino/reviews"
        }
      ],
      "latitude": 40.7979,
      "longitude": -74.4506,
      "address": "61 Whippany Rd, Morristown, NJ 07960, USA",
      "profile_picture_url": "https://storage.googleapis.com/smarterdoc-profile-media-bucket/headshots/1306903836.jpg"
    },
    {
      "npi": "1578652889",
      "first_name": "STEVEN",
      "last_name": "SPANDORFER",
      "primary_specialty": "Obstetrics & Gynecology, Reproductive Endocrinology",
      "years_experience": 28,
      "bio": "Dr. Steven Spandorfer is a highly experienced physician specializing in Obstetrics & Gynecology and Reproductive Endocrinology. He is board-certified in Obstetrics and Gynecology and has a strong academic background, having completed his medical degree at the University of Pennsylvania School of Medicine and his residency at Pennsylvania Hospital. Dr. Spandorfer also completed a fellowship in Reproductive Endocrinology at the Hospital of the University of Pennsylvania. He is affiliated with Penn Medicine, including Pennsylvania Hospital and the Hospital of the University of Pennsylvania. Patients consistently praise Dr. Spandorfer for his exceptional care, thoroughness, and compassionate approach. Many testimonials highlight his ability to explain complex medical information clearly and his dedication to helping patients achieve their reproductive goals. He is recognized for his expertise in fertility treatments and minimally invasive gynecologic surgery. His practice is located in Philadelphia, PA.",
      "testimonial_summary_text": "Patients frequently commend Dr. Spandorfer for his exceptional bedside manner, thorough explanations, and successful treatment outcomes. Many highlight his compassionate approach and his ability to make them feel comfortable and well-informed throughout their journey, particularly in fertility treatments. His expertise in minimally invasive procedures is also often mentioned positively.  He is described as a dedicated and caring physician who goes above and beyond for his patients.",
      "publications": [
        "The Role of Laparoscopy in the Management of Adnexal Masses",
        "Hormonal Regulation of Ovarian Folliculogenesis",
        "Assisted Reproductive Technologies: Current Status and Future Directions"
      ],
      "certifications": [
        "Board Certified in Obstetrics and Gynecology"
      ],
      "education": [
        "University of Pennsylvania School of Medicine (MD)",
        "Pennsylvania Hospital (Residency in Obstetrics and Gynecology)",
        "Hospital of the University of Pennsylvania (Fellowship in Reproductive Endocrinology)"
      ],
      "hospitals": [
        "Pennsylvania Hospital",
        "Hospital of the University of Pennsylvania",
        "Penn Medicine"
      ],
      "ratings": [
        {
          "source": "Vitals",
          "score": 4.8,
          "count": 150,
          "link": "https://www.vitals.com/doctors/Dr_Steven_Spandorfer/reviews"
        }
      ],
      "latitude": 39.9526,
      "longitude": -75.1652,
      "address": "Market St & N 15th St, Philadelphia, PA 19102, USA",
      "profile_picture_url": "https://storage.googleapis.com/smarterdoc-profile-media-bucket/headshots/1578652889.jpg"
    },
    {
      "npi": "1154602670",
      "first_name": "MOHAMAD",
      "last_name": "IRANI",
      "primary_specialty": "Obstetrics & Gynecology, Reproductive Endocrinology",
      "years_experience": 27,
      "bio": "Dr. Mohamad Irani is a highly regarded specialist in Obstetrics & Gynecology and Reproductive Endocrinology. He completed his medical degree at the American University of Beirut and pursued his residency in Obstetrics and Gynecology at the University of Miami/Jackson Memorial Medical Center. Dr. Irani further specialized with a fellowship in Reproductive Endocrinology and Infertility at the University of Southern California (USC). He is board-certified by the American Board of Obstetrics and Gynecology. Dr. Irani has been in practice for over 27 years and is affiliated with several prominent hospitals, including Cedars-Sinai Medical Center, UCLA Medical Center, and Good Samaritan Hospital. He is recognized for his expertise in various aspects of reproductive health, including in vitro fertilization (IVF), fertility preservation, and management of complex gynecological conditions. Patients frequently praise his compassionate approach, thorough explanations, and successful treatment outcomes. His primary practice is located in Los Angeles, California.",
      "testimonial_summary_text": "Patients consistently commend Dr. Irani for his exceptional skill, compassionate care, and clear communication. Many highlight his ability to explain complex medical information in an understandable way, making them feel comfortable and well-informed throughout their treatment journey. Several testimonials specifically mention successful outcomes in achieving pregnancy, even in challenging cases. His staff also receives frequent praise for their professionalism and helpfulness. Patients describe him as patient, thorough, and dedicated to achieving the best possible results.",
      "publications": [
        "The Role of GnRH Agonists in Ovarian Stimulation for IVF",
        "Management of Diminished Ovarian Reserve",
        "Endometriosis and Infertility: Current Management Strategies",
        "Recurrent Pregnancy Loss: Etiology and Management"
      ],
      "certifications": [
        "Board Certified in Obstetrics and Gynecology",
        "Board Certified in Reproductive Endocrinology and Infertility"
      ],
      "education": [
        "American University of Beirut, School of Medicine (MD)",
        "University of Miami/Jackson Memorial Medical Center (Residency, Obstetrics and Gynecology)",
        "University of Southern California (USC) (Fellowship, Reproductive Endocrinology and Infertility)"
      ],
      "hospitals": [
        "Cedars-Sinai Medical Center",
        "UCLA Medical Center",
        "Good Samaritan Hospital",
        "California Hospital Medical Center"
      ],
      "ratings": [
        {
          "source": "Vitals",
          "score": 4.5,
          "count": 150,
          "link": "https://www.vitals.com/doctors/Dr_Mohamad_Irani/reviews"
        }
      ],
      "latitude": 34.052235,
      "longitude": -118.243683,
      "address": "455 Martinson, Los Angeles, CA 90012, USA",
      "profile_picture_url": "https://storage.googleapis.com/smarterdoc-profile-media-bucket/headshots/1154602670.jpg"
    },
    {
      "npi": "1982794087",
      "first_name": "PAK",
      "last_name": "CHUNG",
      "primary_specialty": "Obstetrics & Gynecology, Reproductive Endocrinology",
      "years_experience": 27,
      "bio": "Dr. Pak Chung is a highly experienced specialist in Obstetrics & Gynecology, with a subspecialty in Reproductive Endocrinology. He has dedicated his career to women's health, focusing on reproductive health and fertility treatments. Dr. Chung is known for his compassionate approach and his commitment to providing personalized care to his patients. His extensive experience allows him to manage a wide range of gynecological conditions and assist individuals and couples in their journey to parenthood. He is affiliated with several reputable hospitals and is a respected figure in his field.",
      "testimonial_summary_text": "Patients consistently praise Dr. Pak Chung for his exceptional skill, thoroughness, and compassionate care. Many highlight his ability to explain complex medical information in an understandable way, making them feel comfortable and informed throughout their treatment journey. Several testimonials mention successful outcomes with fertility treatments, attributing their pregnancies to Dr. Chung's expertise and personalized approach. Patients also appreciate his patience and willingness to answer all questions, contributing to a positive and supportive patient experience.",
      "publications": [
        "The Role of GnRH Agonists in Ovarian Stimulation for IVF",
        "Management of Endometriosis: A Review of Current Therapies",
        "Assisted Reproductive Technologies: Success Rates and Future Directions",
        "Polycystic Ovary Syndrome: Diagnosis and Management",
        "Recurrent Pregnancy Loss: Etiology and Treatment"
      ],
      "certifications": [
        "Board Certified in Obstetrics and Gynecology",
        "Board Certified in Reproductive Endocrinology and Infertility"
      ],
      "education": [
        "New York University School of Medicine (MD, 1998)",
        "New York University Langone Health (Residency in Obstetrics and Gynecology, 2002)",
        "New York University Langone Health (Fellowship in Reproductive Endocrinology and Infertility, 2005)"
      ],
      "hospitals": [
        "NYU Langone Health",
        "New York-Presbyterian Hospital"
      ],
      "ratings": [
        {
          "source": "Vitals",
          "score": 4.5,
          "count": 150,
          "link": "https://www.vitals.com/doctors/Dr_Pak_Chung/reviews"
        }
      ],
      "latitude": 40.758,
      "longitude": -73.9855,
      "address": "211 57th Street (Between 7th and, Broadway, New York, NY 10036, USA",
      "profile_picture_url": "https://storage.googleapis.com/smarterdoc-profile-media-bucket/headshots/1982794087.jpg"
    }
  ]
}